bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Documents/ПланРегламентныхОперацийДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланРегламентныхОперацийДУ</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорДУ</Name>
					<Type><v8:Type>cfg:CatalogRef.ДоговорДУ</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОперацийПользователя</Name>
					<Type><v8:Type>cfg:CatalogRef.ВидыОперацийЗакрытияПериода</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланВечернихОпераций</Name>					<Type>
						<v8:Type>cfg:DocumentRef.ПланРегламентныхОперацийДУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/CommonModules/ФоновыеЗаданияСервер/Ext/Module.bsl
#Область IMDEV_8663_2_СвязьГрупп

&ИзменениеИКонтроль("СоздатьПланРегламентныхОперацийДУ")
Функция IM86632_СоздатьПланРегламентныхОперацийДУ(ДатаПериода, ДоговорДУ, ТаблицаОпераций, ТекущийПлан, ГруппаОперацийПользователя, УчитыватьВыполненные, СоответствиеОперацияТаблица = Неопределено) Экспорт
	
	Выполнено = Истина;
	
	Если ГруппаОперацийПользователя = Неопределено Тогда
		ГруппаОперацийПользователя = Справочники.ВидыОперацийЗакрытияПериода.ПустаяСсылка();
	КонецЕсли;
	
	
	Если ТекущийПлан = Неопределено Тогда
		ТекДокумент = Документы.ПланРегламентныхОперацийДУ.СоздатьДокумент();
	Иначе
		ТекДокумент = ТекущийПлан.ПолучитьОбъект();
		ТекДокумент.Операции.Очистить();
	КонецЕсли;
	
	
	Для каждого ТекСтрока из ТаблицаОпераций Цикл
		
		НоваяСтрокаДокумента = ТекДокумент.Операции.Добавить();
		НоваяСтрокаДокумента.ВидОперации 	= ТекСтрока.ВидОперации;
		НоваяСтрокаДокумента.Выполнять 		= ТекСтрока.Выполнять;
		
	КонецЦикла;
	
	ТекДокумент.ГруппаОперацийПользователя 	= ГруппаОперацийПользователя;
	
	Если ЗначениеЗаполнено(ГруппаОперацийПользователя) Тогда
		ДатаПроведения = Дата(Формат(ДатаПериода, "ДФ=""ггггММдд""") + Формат(ГруппаОперацийПользователя.ВремяРеглОпераций,"ДФ=""ЧЧммсс"""));
	Иначе
		ДатаПроведения = Дата(Формат(ДатаПериода, "ДФ=""ггггММдд""") + Формат(ПолныеПрава.ОкончаниеРабочегоДня(),"ДФ=""ЧЧммсс""")); 
	КонецЕсли;

	ТекДокумент.Дата 						= ДатаПроведения;
	ТекДокумент.ДоговорДУ 					= ДоговорДУ;
	
  
	Если ТекДокумент.ПометкаУдаления Тогда
		ТекДокумент.ПометкаУдаления = Ложь;
	КонецЕсли;


	Попытка
#Вставка
		Если СоответствиеОперацияТаблица <> Неопределено Тогда
			ВечернийПланИзКэша = СоответствиеОперацияТаблица.Получить("ПланВечернихОпераций");
			Если ЗначениеЗаполнено(ВечернийПланИзКэша) Тогда
				ТекДокумент.ПланВечернихОпераций = ВечернийПланИзКэша;
			КонецЕсли;
		КонецЕсли;
#КонецВставки
		ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//TM-2261-----
		Отказ = Ложь;
		// IMAPPS-35037++ Модифицировано: добавлен параметр СоответствиеОперацияТаблица
		ТекДокумент.ВыполнитьРегламентныеПроцедуры(Отказ, УчитыватьВыполненные, СоответствиеОперацияТаблица);
		Если Отказ Тогда
			Выполнено = Ложь;
			ТекДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Если НЕ УчитыватьВыполненные Тогда // ASP-188070
				Документы.ПланРегламентныхОперацийДУ.ПометитьНаУдалениеПодчиненныеДокументы(ТекДокумент.Ссылка)
			КонецЕсли;
			ТекстСообщения = СтрШаблон("Не удалось провести документ %1 т.к. при выполнении регламентных операций были ошибки.", ТекДокумент.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ТекДокумент.Ссылка);
		КонецЕсли;
		//-----TM-2261
	Исключение
		Выполнено = Ложь;
		ТекстСообщения = НСтр("ru = 'Документ:   '") + ТекДокумент.Ссылка;
		
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Не удалось провести документ по договору ДУ: '") + ДоговорДУ + НСтр("ru = '. Причина: '") + Ошибка.Описание;
		ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.Таб + ТекстОшибки;
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст 		= ТекстСообщения;
		СообщениеПользователю.КлючДанных 	= ТекДокумент.Ссылка;
		СообщениеПользователю.Сообщить();
		
	КонецПопытки;
	
	Возврат Выполнено;
	
КонецФункции

#КонецОбласти
